{
  "expBoard": [
    {
      "id": 5,
      "employer": "Freightera Logistic Inc.",
      "designation": "Software Engineer",
      "compLogo": "https://hnngo-portfolio.s3.amazonaws.com/freightera_logo.png",
      "headSentence": "Freightera Logistics Inc. is a Vancouver-based business to business (B2B) online freight marketplace that allows businesses to get road or rail transport quotes from North American carriers, and make direct shipment bookings.",
      "jDHeader": "Responsibility:",
      "jobDescription": [
        "Maintaining and developed a seamlessly automated flow of works related to accounting team such as create/update/delete invoices or bills, automatically record transactions, refunds, and credit memos.",
        "Helping boosting the performance of the accounting team and make the auditing job more reliable.",
        "Developing the notification system that helps detect overdue invoices/bills, real-time notification of whenever users have difficulty in making payment, and a real-time system to detect all the suspicious payment fraud activities."
      ],
      "location": "Vancouver, British Columbia, Canada",
      "timeFrom": "Apr 2021",
      "timeTo": "now",
      "show": "on"
    },
    {
      "id": 4,
      "employer": "Shopee",
      "designation": "Frontend Developer",
      "compLogo": "https://hnngo-portfolio.s3.amazonaws.com/shopee_logo.png",
      "headSentence": "At the time when I still lived in Singapore, I was working as a Frontend Developer in Shopee, Singapore. Shopee is a Singaporean e-commerce platform under the Sea Group. Shopee first launched in Singapore in 2015, and since expanded its reach to Malaysia, Thailand, Taiwan, Indonesia, Vietnam, the Philippines, and Brazil",
      "jDHeader": "Responsibility:",
      "jobDescription": [
        "Mainly worked on authentication-related UI such as login/signup, update user setting, KYC (know your customer), enhance users’ growth like welcome package, and user notification feature.",
        "Tracking user behavioral data toward the authentication process.",
        "Integrating fraud check UI into critical flows such as 3rd party social signup/login (Facebook, Google, Apple) or verify phone SMS in check out flow. Decrease the SMS cost by sending OTP code through WhatsApp."
      ],
      "location": "Science Park, Singapore",
      "timeFrom": "Nov 2019",
      "timeTo": "Jan 2021",
      "show": "on"
    },
    {
      "id": 3,
      "employer": "Nanyang Technological University",
      "designation": "Research Engineer",
      "compLogo": "https://hnngo-portfolio.s3.amazonaws.com/ntu_logo.png",
      "headSentence": "I have been working as a Research Engineer in School of Electrical and Electronics Engineering at Nangyang Technological University, Singapore for a year and a half. My research topic is about Control and Controllability of Dynamic Complex Networks: Theories and Strategies.",
      "jDHeader": "Ongoing Research Topics",
      "jobDescription": [
        "Counter controllability by removing the critical nodes in maximum matching paths",
        "Majority Control of Directed Networks based on Network Flow problems",
        "Preventing network crash in KQ-model by applying cherished links to a certain number of edges"
      ],
      "location": "Jurong West, Singapore",
      "timeFrom": "May 2018",
      "timeTo": "Nov 2019",
      "show": "on"
    },
    {
      "id": 2,
      "employer": "Fiot Co. LTD., Vietnam",
      "designation": "Embedded Firmware Development Engineer",
      "compLogo": "https://hnngo-portfolio.s3.amazonaws.com/fiot_logo.jpg",
      "headSentence": "After graduation, I got my first job at a start-up outsourcing company which provides innovative solutions for embedded system and IoT application development.",
      "jDHeader": "Technologies/Applications",
      "jobDescription": [
        "Working with IoT Product Development using some wireless solutions such as Bluetooth, WiFi, Zigbee and custom RF"
      ],
      "location": "Ho Chi Minh, Vietnam",
      "timeFrom": "May 2017",
      "timeTo": "Oct 2017",
      "show": "on"
    },
    {
      "id": 1,
      "employer": "MobiFone Testing and Maintenance Center",
      "designation": "Internship Research Engineer",
      "compLogo": "https://hnngo-portfolio.s3.amazonaws.com/mobifone_logo.png",
      "headSentence": "MobiFone Testing and Maintenance Center, Ho Chi Minh City, Vietnam is one of the best place for me to take my very first internship when I lived in Vietnam. MobiFone is the first and currently third largest telecommunications provider in Vietnam. Therefore, to be an internship member in Mobifone is a big achievement to me and it did help me a lot in graduating from university in Electronics and Telecommunication Engineering field.",
      "jDHeader": "Internship works",
      "jobDescription": [
        "Understanding about implementing LTE Accessibility Optimization and measured LTE Accessibility performance",
        "Performing a real-life operation in measuring 4G signal in a 1 km area location"
      ],
      "location": "Ho Chi Minh, Vietnam",
      "timeFrom": "June 2016",
      "timeTo": "Sep 2016",
      "show": "on"
    },
    {
      "id": 0,
      "employer": "HCMC University of Technology",
      "designation": "Student",
      "compLogo": "https://hnngo-portfolio.s3.amazonaws.com/hcmut_logo.png",
      "headSentence": "Ho Chi Minh City University of Technology is one of the most prestigious univeristy under Vietnam National University Ho Chi Minh City. My major field is Electronics - Telecomunication Engineering. During the university time, beside the major specialized knowledges, I have earned a lot of experience in teamwork, comunication, research skill and problem solving",
      "jDHeader": "Projects & Thesis",
      "jobDescription": [
        "Smart Water Analysis and Monitoring System. Developed a smart device to collect some standard index of water such as pH, ORP, Temperature, Turbidity, EC, DO, water flow, etc",
        "Used Raspberry Pi to transfer the voice which was recorded (in .wave) by a USB-Microphone into text by two methods: online and offline"
      ],
      "location": "Ho Chi Minh, Vietnam",
      "timeFrom": "Aug 2012",
      "timeTo": "Apr 2017",
      "show": "off"
    }
  ]
}
