{
  "projectInfo": [
    {
      "id": 4,
      "name": "Poll Generator",
      "description": "A poll service that allows clients to create or vote polls with pre-defined choices. The poll can be configured as a public poll or a private poll. Clients are able to select one choice or multiple choices at a time",
      "details": [
        "The project is packed into Vagrantfile which contains all the declarative configuration about software requirements, packages, operating system configuration, etc...",
        "All of the poll information are initially loaded from postgresql whenever server starts",
        "Redis DB is responsible for high speed voting to avoid directly write to Postgresql DB which may cause losing the information due to high speed",
        "Nginx is used to create a reverse proxy for  more efficitently handling route that require static files and forward dynamic routes to the proper server",
        "Client side is bootstrapped by create-react-app and I used Redux as a state management for my project",
        "The responsive, mobile-web feature and other CSS prototypes I used for this project are from Bootstrap and written using stylesheet language Sass."
      ],
      "technologies": [
        "vagrant",
        "redis",
        "postgresql",
        "nodejs",
        "socketio",
        "react",
        "redux",
        "bootstrap"
      ],
      "bannerImg": "https://hnngo-portfolio.s3.amazonaws.com/projects/poll_generator/banner.png",
      "website": "",
      "githubLink": "https://github.com/hnngo/poll-generator-with-redis",
      "devices": "https://hnngo-portfolio.s3.amazonaws.com/projects/poll_generator/devices.png"
    },
    {
      "id": 3,
      "name": "Social X",
      "description": "Social X is online social media which allows users to share their daily thoughts and interact with other users.",
      "details": [
        "Social X is developed as a basic social media platform. Users can create accounts or log in with their Gmail accounts (OAuth). Users can upload a status, post a comment, hit like, edit old posts or update their personal information such as birthday, career or living place.",
        "Besides, each user can change their personal avatar to their favourite image. User can interact with others by commenting on their posts, send friend requests to other users or delete any comment of their own posts or their own comments.",
        "The application server is bootstrapped by Node.js and Express.js is used as a web application framework for Node.js. Express helps setup route logic of all APIs for Http Requests.",
        "MongoDB Cloud is the project's database which stores user information, post information and other relating files such as user avatar image. Clients can view up-to-date any user profile page in real-time because of automatically updating if there are any changes in profile such as basic user information or incoming friend requests thanks to Socket.io.",
        "The Authentication process is handled using Passport.js. User can both sign in/up by email and password (no email verification needed) and login with Google account using Google OAuth 2.0.",
        "Client side is bootstrapped by create-react-app and I used Redux as a state management for my project. Other React or Redux related packages like react-router, redux-form or redux-thunk are used for making project work effectively and smoothly.",
        "The responsive, mobile-web feature and other CSS prototypes I used for this project are from Bootstrap and written using stylesheet language Sass."
      ],
      "technologies": [
        "nodejs",
        "mongodb",
        "passportjs",
        "socketio",
        "react",
        "redux",
        "bootstrap"
      ],
      "bannerImg": "https://hnngo-portfolio.s3.amazonaws.com/projects/social_x/banner.png",
      "website": "https://sxmedia.herokuapp.com/",
      "githubLink": "https://github.com/hnngo/social-x",
      "devices": "https://hnngo-portfolio.s3.amazonaws.com/projects/social_x/devices.png"
    },
    {
      "id": 2,
      "name": "Shoeniverse",
      "description": "Shoeniverse is a website which allows user purchase shoes, boots and other accessories for both men and women.",
      "details": [
        "The project is initiated by create-react-app and I used Redux as a state management",
        "Google Firebase plays the role of authentication. Both creating new account and signing in account are processed by using Google Firebase API",
        "The responsive, mobile-first feature css I used for this project is from Bootstrap 4",
        "All the pictures of shoes, sneakers, boots and other accessories used non commercially in the project are from these real-life brands: Nike, Adidas, Vans, Dr Martens, Farfetch, Warby Parker, Coach."
      ],
      "technologies": ["react", "redux", "firebase", "bootstrap"],
      "bannerImg": "https://hnngo-portfolio.s3.amazonaws.com/projects/shoeniverse/banner.png",
      "website": "https://shoes-shopping-website.firebaseapp.com/",
      "githubLink": "https://hnngo-portfolio.s3.amazonaws.com/projects/shoeniverse/devices.png"
    },
    {
      "id": 1,
      "name": "Dashboard Kamela",
      "description": "Kamela is a stock website allows user to get the Stock Market Overview, look up for real-life Stock Symbol, access to some Technical Indicators such as CCI, CMO, APO, etc...",
      "details": [
        "The project is initiated by create-react-app",
        "Firebase Hosting is used as a hosting service for this project.",
        "The responsive, mobile-first feature css I used for this project is from Bootstrap 4",
        "I used d3.js as a tool for visualizing almost stock data. The types of chart are varied such as line graph, circle point chart, bar chart, area and pie chart.",
        "For the limitation of information about real company, I generated fake company data by using Mockaroo.",
        "The side bar is created for only making the dashboard be like the real stock website dashbord. Therefore it has no functionality."
      ],
      "technologies": ["react", "firebase", "d3", "bootstrap"],
      "bannerImg": "https://hnngo-portfolio.s3.amazonaws.com/projects/kamela/banner.png",
      "website": "https://dbkamela.firebaseapp.com/",
      "githubLink": "https://github.com/hnngo/dashboard-kamela",
      "devices": "https://hnngo-portfolio.s3.amazonaws.com/projects/kamela/devices.png"
    },
    {
      "id": 0,
      "name": "JobOL",
      "description": "JobOL is an IOS application that allows users search for his/her dream jobs quickly based on search keyword and location.",
      "details": [
        "The project is initiated by Expo-cli, written in React Native and I used Redux as a state management for my project",
        "The application provides the job information based on search keyword and location. The job information is derived from GIT HUB Api.",
        "Google Firebase is used in the part of authentication and storing data in real-time databse. Both creating account or signing in account are processed by using Google Firebase API.",
        "For the Cross Platform React Native UI Toolkit, I used React Native Elements."
      ],
      "technologies": ["react", "redux", "firebase"],
      "bannerImg": "https://hnngo-portfolio.s3.amazonaws.com/projects/jobol/banner.png",
      "website": "",
      "githubLink": "https://github.com/hnngo/jobOL-react-native",
      "devices": "https://hnngo-portfolio.s3.amazonaws.com/projects/jobol/devices.png"
    }
  ],
  "devices": {
    "webImac": "https://hnngo-portfolio.s3.amazonaws.com/devices_placeholder/imac.png",
    "webLaptop": "https://hnngo-portfolio.s3.amazonaws.com/devices_placeholder/macbook.png",
    "phone": "https://hnngo-portfolio.s3.amazonaws.com/devices_placeholder/iphone.png"
  },
  "techlogo": {
    "react": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/react.png",
    "redux": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/redux.png",
    "firebase": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/firebase.png",
    "d3": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/d3.png",
    "bootstrap": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/bootstrap.png",
    "nodejs": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/nodejs.png",
    "passportjs": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/passportjs.png",
    "mongodb": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/mongodb.png",
    "socketio": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/socketio.png",
    "vagrant": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/vagrant.png",
    "redis": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/redis.png",
    "postgresql": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/postgresql.png",
    "nginx": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/nginx.png",
    "aws": "https://hnngo-portfolio.s3.amazonaws.com/tech_logo/aws.png"
  }
}
